app/controllers/post_images_controller.rb

  def create
    @post_image = PostImage.new(post_image_params)
    @post_image.user_id = current_user.id
    if @post_image.save
---
INSERT INTO "post_images" ("shop_name", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["shop_name", "rails"], ["caption", "a little good"], ["user_id", 1], ["created_at", "2022-05-31 15:39:08.961164"], ["updated_at", "2022-05-31 15:39:08.961164"]]

  def index
    @post_images = PostImage.page(params[:page])
---
SELECT "post_images".* FROM "post_images" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "post_images"